Tekla Open API Reference for Tekla Structures 2025
AttributesBase Methods
The AttributesBase type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
LoadAttributes
 Loads the attributes from the specified file.
Top
See Also
Reference
AttributesBase Class
Tekla.Structures.Drawing Namespace